**Author:** @KyleKotowick
**Workflow Run:** [#2006377354-1](https://github.com/Invicton-Labs/public-lambda-layers/actions/runs/2006377354/attempts/1)
| Task | Result |
| ---- | ------ |
| 🖌 **Terraform Format** | ✅`success` |
| ⚙️ **Terraform Initialization** | ✅`success` |
| 📖 **Terraform Plan** | ✅`success` |

<details><summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # time_static.last_updated["numpy.1.19.5.python3.6.arm64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.19.5.python3.6.x86_64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.21.5.python3.7.arm64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.21.5.python3.7.x86_64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.22.3.python3.8.arm64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.22.3.python3.8.x86_64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.22.3.python3.9.arm64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # time_static.last_updated["numpy.1.22.3.python3.9.x86_64"] will be created
  + resource "time_static" "last_updated" {
      + day      = (known after apply)
      + hour     = (known after apply)
      + id       = (known after apply)
      + minute   = (known after apply)
      + month    = (known after apply)
      + rfc3339  = (known after apply)
      + second   = (known after apply)
      + triggers = (known after apply)
      + unix     = (known after apply)
      + year     = (known after apply)
    }

  # module.docker_build["numpy.1.19.5.python3.6.arm64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.19.5.python3.6.arm64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
      + prefix      = (sensitive)
    }

  # module.docker_build["numpy.1.19.5.python3.6.arm64"].random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.docker_build["numpy.1.19.5.python3.6.x86_64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.19.5.python3.6.x86_64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
      + prefix      = (sensitive)
    }

  # module.docker_build["numpy.1.19.5.python3.6.x86_64"].random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.docker_build["numpy.1.21.5.python3.7.arm64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.21.5.python3.7.arm64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
      + prefix      = (sensitive)
    }

  # module.docker_build["numpy.1.21.5.python3.7.arm64"].random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.docker_build["numpy.1.21.5.python3.7.x86_64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.21.5.python3.7.x86_64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
      + prefix      = (sensitive)
    }

  # module.docker_build["numpy.1.21.5.python3.7.x86_64"].random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.docker_build["numpy.1.22.3.python3.8.arm64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.22.3.python3.8.arm64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
      + prefix      = (sensitive)
    }

  # module.docker_build["numpy.1.22.3.python3.8.arm64"].random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.docker_build["numpy.1.22.3.python3.8.x86_64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.22.3.python3.8.x86_64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = (known after apply)
      + prefix      = (sensitive)
    }

  # module.docker_build["numpy.1.22.3.python3.8.x86_64"].random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.docker_build["numpy.1.22.3.python3.9.arm64"].null_resource.shell will be created
  + resource "null_resource" "shell" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.docker_build["numpy.1.22.3.python3.9.arm64"].random_id.outputs will be created
  + resource "random_id" "outputs" {
      + b64_std     = (known after apply)
      + b64_url     = (known after ap
```
</details>